; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=135, out_folder=./training, instance_id=5, seed=2029, goal_proportion=0.03

(define (problem blocksworld-05)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 - object)
 (:init 
    (arm-empty)
    (clear b8)
    (on-table b8)
    (clear b23)
    (on b23 b15)
    (on b15 b79)
    (on-table b79)
    (clear b130)
    (on-table b130)
    (clear b9)
    (on b9 b63)
    (on b63 b133)
    (on b133 b58)
    (on b58 b126)
    (on b126 b95)
    (on b95 b77)
    (on b77 b113)
    (on b113 b65)
    (on b65 b98)
    (on b98 b128)
    (on b128 b88)
    (on b88 b54)
    (on b54 b97)
    (on b97 b35)
    (on b35 b111)
    (on-table b111)
    (clear b76)
    (on b76 b44)
    (on b44 b28)
    (on b28 b57)
    (on b57 b32)
    (on b32 b75)
    (on b75 b67)
    (on b67 b17)
    (on b17 b103)
    (on b103 b108)
    (on b108 b87)
    (on-table b87)
    (clear b18)
    (on b18 b11)
    (on b11 b6)
    (on b6 b99)
    (on-table b99)
    (clear b56)
    (on b56 b43)
    (on-table b43)
    (clear b42)
    (on-table b42)
    (clear b96)
    (on b96 b116)
    (on b116 b86)
    (on b86 b34)
    (on b34 b81)
    (on b81 b16)
    (on b16 b122)
    (on-table b122)
    (clear b40)
    (on b40 b7)
    (on b7 b72)
    (on-table b72)
    (clear b53)
    (on b53 b121)
    (on-table b121)
    (clear b50)
    (on-table b50)
    (clear b70)
    (on-table b70)
    (clear b19)
    (on-table b19)
    (clear b47)
    (on b47 b107)
    (on b107 b125)
    (on b125 b110)
    (on b110 b22)
    (on b22 b102)
    (on-table b102)
    (clear b100)
    (on b100 b20)
    (on-table b20)
    (clear b1)
    (on-table b1)
    (clear b27)
    (on b27 b2)
    (on-table b2)
    (clear b112)
    (on b112 b94)
    (on b94 b62)
    (on b62 b132)
    (on b132 b83)
    (on-table b83)
    (clear b21)
    (on b21 b92)
    (on b92 b135)
    (on b135 b90)
    (on b90 b59)
    (on b59 b118)
    (on b118 b80)
    (on-table b80)
    (clear b12)
    (on b12 b26)
    (on-table b26)
    (clear b61)
    (on b61 b41)
    (on b41 b49)
    (on b49 b48)
    (on b48 b109)
    (on-table b109)
    (clear b55)
    (on b55 b39)
    (on b39 b115)
    (on-table b115)
    (clear b30)
    (on b30 b101)
    (on b101 b91)
    (on b91 b10)
    (on b10 b78)
    (on-table b78)
    (clear b38)
    (on b38 b73)
    (on b73 b85)
    (on-table b85)
    (clear b71)
    (on b71 b134)
    (on-table b134)
    (clear b37)
    (on b37 b123)
    (on b123 b89)
    (on b89 b14)
    (on b14 b131)
    (on b131 b3)
    (on b3 b31)
    (on b31 b129)
    (on b129 b5)
    (on b5 b25)
    (on b25 b24)
    (on b24 b117)
    (on b117 b13)
    (on b13 b66)
    (on b66 b4)
    (on b4 b84)
    (on b84 b33)
    (on-table b33)
    (clear b29)
    (on b29 b69)
    (on-table b69)
    (clear b64)
    (on-table b64)
    (clear b106)
    (on-table b106)
    (clear b51)
    (on b51 b60)
    (on b60 b104)
    (on b104 b52)
    (on b52 b119)
    (on b119 b114)
    (on b114 b68)
    (on b68 b93)
    (on-table b93)
    (clear b120)
    (on b120 b82)
    (on b82 b74)
    (on-table b74)
    (clear b36)
    (on b36 b105)
    (on b105 b45)
    (on-table b45)
    (clear b46)
    (on b46 b124)
    (on b124 b127)
    (on-table b127))
 (:goal  (and 
    (clear b2)
    (on b2 b3)
    (on b3 b4)
    (on-table b4)
    (clear b1)
    (on-table b1))))

; plan
1. (unstack b27 b2)
   deleted: (on b27 b2) (clear b27) (arm-empty)
   added: (holding b27) (clear b2)
   goals met: 3 of 6
2. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 3 of 6
3. (unstack b37 b123)
   deleted: (on b37 b123) (clear b37) (arm-empty)
   added: (holding b37) (clear b123)
   goals met: 3 of 6
4. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 3 of 6
5. (unstack b123 b89)
   deleted: (on b123 b89) (clear b123) (arm-empty)
   added: (holding b123) (clear b89)
   goals met: 3 of 6
6. (putdown b123)
   deleted: (holding b123)
   added: (clear b123) (arm-empty) (on-table b123)
   goals met: 3 of 6
7. (unstack b89 b14)
   deleted: (on b89 b14) (clear b89) (arm-empty)
   added: (holding b89) (clear b14)
   goals met: 3 of 6
8. (putdown b89)
   deleted: (holding b89)
   added: (clear b89) (arm-empty) (on-table b89)
   goals met: 3 of 6
9. (unstack b14 b131)
   deleted: (on b14 b131) (clear b14) (arm-empty)
   added: (holding b14) (clear b131)
   goals met: 3 of 6
10. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 3 of 6
11. (unstack b131 b3)
   deleted: (on b131 b3) (clear b131) (arm-empty)
   added: (holding b131) (clear b3)
   goals met: 3 of 6
12. (putdown b131)
   deleted: (holding b131)
   added: (clear b131) (arm-empty) (on-table b131)
   goals met: 3 of 6
13. (unstack b3 b31)
   deleted: (on b3 b31) (clear b3) (arm-empty)
   added: (holding b3) (clear b31)
   goals met: 3 of 6
14. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 3 of 6
15. (unstack b31 b129)
   deleted: (on b31 b129) (clear b31) (arm-empty)
   added: (holding b31) (clear b129)
   goals met: 3 of 6
16. (putdown b31)
   deleted: (holding b31)
   added: (clear b31) (arm-empty) (on-table b31)
   goals met: 3 of 6
17. (unstack b129 b5)
   deleted: (on b129 b5) (clear b129) (arm-empty)
   added: (holding b129) (clear b5)
   goals met: 3 of 6
18. (putdown b129)
   deleted: (holding b129)
   added: (clear b129) (arm-empty) (on-table b129)
   goals met: 3 of 6
19. (unstack b5 b25)
   deleted: (on b5 b25) (clear b5) (arm-empty)
   added: (holding b5) (clear b25)
   goals met: 3 of 6
20. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 3 of 6
21. (unstack b25 b24)
   deleted: (on b25 b24) (clear b25) (arm-empty)
   added: (holding b25) (clear b24)
   goals met: 3 of 6
22. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 3 of 6
23. (unstack b24 b117)
   deleted: (on b24 b117) (clear b24) (arm-empty)
   added: (holding b24) (clear b117)
   goals met: 3 of 6
24. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 3 of 6
25. (unstack b117 b13)
   deleted: (on b117 b13) (clear b117) (arm-empty)
   added: (holding b117) (clear b13)
   goals met: 3 of 6
26. (putdown b117)
   deleted: (holding b117)
   added: (clear b117) (arm-empty) (on-table b117)
   goals met: 3 of 6
27. (unstack b13 b66)
   deleted: (on b13 b66) (clear b13) (arm-empty)
   added: (holding b13) (clear b66)
   goals met: 3 of 6
28. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 3 of 6
29. (unstack b66 b4)
   deleted: (on b66 b4) (clear b66) (arm-empty)
   added: (holding b66) (clear b4)
   goals met: 3 of 6
30. (putdown b66)
   deleted: (holding b66)
   added: (clear b66) (arm-empty) (on-table b66)
   goals met: 3 of 6
31. (unstack b4 b84)
   deleted: (on b4 b84) (clear b4) (arm-empty)
   added: (holding b4) (clear b84)
   goals met: 3 of 6
32. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 4 of 6
33. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 4 of 6
34. (stack b3 b4)
   deleted: (clear b4) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b4)
   goals met: 5 of 6
35. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 4 of 6
36. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 6 of 6
